Repository: collective/collective.portlet.contact
Catalog: collective/portlet/contact/locales/*/LC_MESSAGES/collective.portlet.contact.po
Languages: fr

source: Back-end
fr: Support de données

source: Changes canceled.
fr: Les changement ont été annulés

source: Changes saved, you can now configure the back-end.
fr: Les changements ont été sauvegardé, vous pouvez maintenant configurer le support de données.

source: Configure DUMMY settings
fr: Configuration du support de données DUMMY

source: Configure LDAP settings
fr: Configuration du support de données LDAP

source: Configure the back-end
fr: Configuration du support de données

source: Contact uniq id
fr: Identifiant unique du contact

source: Contact's photo form ${cn}
fr: Formulaire de téléchargement de la photo de ${cn}

source: Employee Type
fr: Fonction

source: Full name
fr: Nom affiché (complet)

source: Is not a JPEG photo
fr: N'est pas une photo au format JPEG

source: Mail
fr: Courriel

source: No changes made.
fr: Aucun changement n'a été fait.

source: Phone
fr: Téléphone

source: Photo URL
fr: Adresse URL de la photo

source: Portlet Contact: Select Back-end
fr: Portlet contact: Selectionnez un support de données

source: Portlet Contact: configure DUMMY settings
fr: Portlet Contact: Configurez le support de données DUMMY

source: Portlet Contact: configure LDAP settings
fr: Portlet Contact: Configurez le support de données LDAP

source: Portlet header
fr: En tête

source: Return to back-end selection
fr: Retour à la sélection du support de données

source: Select Back-end
fr: Sélectionnez un support de données

source: Select the back-end for the Contact portlets.
fr: Sélectionnez le support de données pour les portlets contact.

source: The LDAP authentication credentials are invalid
fr: L'identifiant ou le mot de passe nécessaire pour se connecter au serveur LDAP est invalide.

source: The LDAP credentials provided has not the modify permission.
fr: L'identifiant de connexion au serveur LDAP ne permet pas la modification des données sur ce contact.

source: The LDAP server is unreacheable
fr: Le serveur LDAP n'est pas joignable. Merci de contacter l'administrateur.

source: The contact to display.
fr: Le contact à afficher

source: The contact uniq id.
fr: L'identifiant unique du contact

source: The entry you have specified is not in the LDAP
fr: L'entrée que vous avez spécifiée n'est pas dans le serveur LDAP

source: The photo can't be uploaded
fr: La photo n'a pas pu être ajoutée

source: The photo has been well uploaded
fr: La photo a correctement été téléchargée et ajoutée au contact demandé.

source: The unique ID of the ldap entry.
fr: L'identifiant unique d'une entrée dans le serveur LDAP

source: Title of the rendered portlet
fr: Titre de la portlet

source: Unique ID
fr: Identifiant unique

source: Upload
fr: Télécharger

source: Upload a jpeg photo.
fr: Téléchargez une photo au format JPG

source: collective.portlet.contact Settings
fr: Configuration de collective.portlet.contact

source: collective.portlet.contact default profile
fr: collective.portlet.contact - Profil d'installation

source: collective.portlet.contact uninstall profile
fr: collective.portlet.contact - Profil de désinstallation

source: description_contact_portlet
fr: Une portlet pouvant afficher un contact

source: help_ldap_bind_dn
fr: Le DN du compte administrateur du serveur LDAP. Ce compte doit permettre l'accès à l'ensemble des données.

source: help_ldap_bind_password
fr: Le mot de passe de l'utilisateur administrateur du serveur LDAP.

source: help_ldap_default_photo_path
fr: Cette photo sera utilisée si le contact ne possède pas de photo.

source: help_ldap_photo_ofs_directory
fr: Si les photos sont stockées dans la base de données ZODB alors ce dossier doit contenir une photo ATImage pour chaque contact, par exemple une image ayant l'identifiant "sbo" pour le contact correspondant à uid=sbo.

source: help_ldap_photo_storage
fr: Système de stockage contenant la photo associée au contact: LDAP (image jpeg contenue dans la fiche LDAP du contact) ou OFS (dossier Plone contenant une photo ATImage pour chaque contact, par exemple une image ayant l'identifiant "sbo" pour le contact correspondant à uid=sbo).

source: help_ldap_search_base
fr: Il s'agit de ou sont les contacts dans l'annuaire.

source: help_ldap_server
fr: L'adresse ou le host du serveur LDAP

source: help_ldap_server_port
fr: Le port du serveur LDAP

source: help_search_recursive
fr: Si coché, le serveur LDAP recherchera dans le contact directement à la racine et dans les sous dossiers de manière récursive.

source: label_cancel
fr: Annuler

source: label_ldap_bind_dn
fr: DN de connexion

source: label_ldap_bind_password
fr: Mot de passe de connexion

source: label_ldap_default_photo_path
fr: Chemin d'une photo Plone (ATImage) à utiliser par défaut (ex: images/contact-photo.jpg).

source: label_ldap_photo_cache_maxage
fr: Pour la mise en cache des photos, utilisé par l'entête HTTP "Cache-Control max-age". Unité: en secondes.

source: label_ldap_photo_ofs_directory
fr: Chemin du dossier Plone contenant la photo ATImage du contact (utilisé uniquement si le système de stockage sélectionné est OFS)

source: label_ldap_photo_storage
fr: Système de stockage contenant la photo associée au contact: LDAP ou OFS

source: label_ldap_search_base
fr: Le DN de base pour les contacts.

source: label_ldap_server
fr: Serveur LDAP

source: label_ldap_server_port
fr: Port du serveur LDAP

source: label_save
fr: Sauvegarder

source: label_search_recursive
fr: Recherche récursivement des contacts

source: title_add_contact_portlet
fr: Ajouter une portlet contact

source: title_edit_contact_portlet
fr: Modifier la portlet contact
